// new RegExp(reg.phone)
var idcard15 = '[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{2}'
var idcard18 = '^[1-9]\\d{5}(18|19|([23]\\d))\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$'
var regpayerid = [
  '(^[0-9A-Z]{6,15}$)', //  6-15位  任意数字字母组合
  '(^[0-9]{6}[0-9A-Z]{0,12}$)', //  16-18位  6位数字+最大12任意数字字母组合
  '(^[A-Z][0-9]{6}[0-9A-Z]{0,11}$)', //  16-18位  1位字母+6位数字+最大11位任意数字字母组合
  '(^[A-Z]{2}[0-9]{6}[0-9A-Z]{0,10}$)', //  16-18位  2位字母+6位数字+最大10位任意数字字母组合
  '(^' + idcard15 + '[A-Z][0-9]{0,5}$)', //  19-20位  15位身份证号+最大5位任意数字字母组合
  '(^' + idcard18 + '[A-Z][0-9]{0,2}$)', //  19-20位  18位身份证号+最大2位任意数字字母组合
  '(^[A-Z]{1}' + idcard15 + '[A-Z][0-9]{0,4}$)', //  19-20位  1位字母+15位身份证号+最大4位任意数字字母组合
  '(^[A-Z]{1}' + idcard18 + '[A-Z][0-9]{0,1}$)', //  19-20位  1位字母+18位身份证号+最大1位任意数字字母组合
  '(^[A-Z]{6}[0-9A-Z]{0,14}$)', //  19-20位  6位字母+最大14位任意数字字母组合
  '^(\\d{15}$|^\\d{18}$|^\\d{17}(\\d|X|x))$' // 身份证号
]
export const reg = {
  name: '^[A-Za-z0-9\\u4E00-\\u9FA5]+$', //  用户名
  price: '(^[1-9]([0-9]+)?(\\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\\.[0-9]([0-9])?$)', //  两位小数
  account: '^[A-Za-z0-9-_]+$', //  账号
  password: '^[A-Za-z0-9-_*]+$', //  password
  phone: '^1(3|4|5|7|8)[0-9]{9}$',
  yzm: '^[0-9]{6}$', //  手机验证码
  extractedCode: '(^[0-9a-zA-Z]{10}$)|(^[0-9]{16}$)', //  提取码
  cardId: '^(\\d{15}$|^\\d{18}$|^\\d{17}(\\d|X|x))$', //  身份证号
  titlTaxNo: regpayerid.join('|'), // 纳税人识别号
  titlAddr: '^[a-zA-Z0-9\\u4e00-\\u9fa5]+$', //  抬头地址
  telphone: '(^([0-9]{3,4}-)?[0-9]{7,8})$|(1(3|4|5|7|8)[0-9]{9})$', // 电话含座机
  titlBank: '^[A-Za-z0-9\\u4E00-\\u9FA5]+$', //  抬头银行名称
  titlAccount: '^([0-9]{1})([0-9]{7,29})$', // 抬头银行账号
  email: '^[A-Za-z0-9]+([-_.][A-Za-z0-9]+)*@([A-Za-z0-9]+[-.])+[A-Za-z0-9]{2,4}$' // 邮箱
}
